In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("amazon_fire.csv", encoding = "latin")

In [5]:
df.head()

    ano      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

In [6]:
df.shape

(6454, 5)

In [7]:
df.isnull().sum()

ano           0
mes           0
estado        0
numero      132
encontro      0
dtype: int64

In [9]:
new_col = {"ano" : "year", "mes" : "month", "estado" : "state", "numero" : "number_of_fires", "encontro" : "date"}
df.rename(columns=new_col, inplace=True)

In [10]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [12]:
new_order = [4, 1, 0, 2, 3]
df = df[df.columns[new_order]]

In [13]:
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [14]:
df["number_of_fires"].isnull().sum()

132

In [15]:
df["number_of_fires"].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
6449    False
6450    False
6451    False
6452    False
6453    False
Name: number_of_fires, Length: 6454, dtype: bool

In [17]:
df[df["number_of_fires"].isnull()].tail()

          date     month  year      state number_of_fires
6305  1/1/2008      Maio  2008  Tocantins             NaN
6354  1/1/2017     Julho  2017  Tocantins             NaN
6383  1/1/2006  Setembro  2006  Tocantins             NaN
6415  1/1/1998  Novembro  1998  Tocantins             NaN
6428  1/1/2011  Novembro  2011  Tocantins             NaN

In [19]:
df["number_of_fires"].fillna(0).head()

0    0 Fires
1    0 Fires
2    0 Fires
3    0 Fires
4    0 Fires
Name: number_of_fires, dtype: object

In [22]:
df["number_of_fires"].fillna(method="backfill").head(70)

0     0 Fires
1     0 Fires
2     0 Fires
3     0 Fires
4     0 Fires
       ...
65    1 Fires
66    2 Fires
67    1 Fires
68    0 Fires
69    0 Fires
Name: number_of_fires, Length: 70, dtype: object

In [24]:
df[df["number_of_fires"].isnull()]

          date     month  year      state number_of_fires
68    1/1/2006     Abril  2006       Acre             NaN
110   1/1/2008     Junho  2008       Acre             NaN
127   1/1/2005     Julho  2005       Acre             NaN
206   1/1/2004  Novembro  2004       Acre             NaN
217   1/1/2015  Novembro  2015       Acre             NaN
...        ...       ...   ...        ...             ...
6305  1/1/2008      Maio  2008  Tocantins             NaN
6354  1/1/2017     Julho  2017  Tocantins             NaN
6383  1/1/2006  Setembro  2006  Tocantins             NaN
6415  1/1/1998  Novembro  1998  Tocantins             NaN
6428  1/1/2011  Novembro  2011  Tocantins             NaN

[132 rows x 5 columns]

In [27]:
df["number_of_fires"][69]

'0 Fires'

In [28]:
df.loc[444]

date               1/1/2002
month              Novembro
year                   2002
state               alagoas
number_of_fires         NaN
Name: 444, dtype: object

In [30]:
df.loc[445]

date               1/1/2003
month              Novembro
year                   2003
state               alagoas
number_of_fires          17
Name: 445, dtype: object

In [33]:
df["number_of_fires"].fillna(method="backfill")[444]

'17'

In [35]:
df["number_of_fires"] = df["number_of_fires"].str.strip(" Fires")

In [36]:
df["number_of_fires"] = df["number_of_fires"].str.replace("", "0").astype(float)

In [37]:
df.head()

       date    month  year state  number_of_fires
0  1/1/1998  Janeiro  1998  Acre              0.0
1  1/1/1999  Janeiro  1999  Acre              0.0
2  1/1/2000  Janeiro  2000  Acre              0.0
3  1/1/2001  Janeiro  2001  Acre              0.0
4  1/1/2002  Janeiro  2002  Acre              0.0

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             6454 non-null   object
 1   month            6454 non-null   object
 2   year             6454 non-null   int64
 3   state            6454 non-null   object
 4   number_of_fires  6322 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [39]:
df["month"].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [40]:
month_trans = {
    "Janeiro" : "January",
    "Fevereiro" : "Febuary",
    "Março" : "March",
    "Abril" : "April",
    "Maio" : "May",
    "Junho" : "June",
    "Julho" : "July",
    "Agosto" : "August",
    "Setembro" : "September",
    "Outubro" : "October",
    "Novembro" : "November",
    "Dezembro" : "December"
}

df["month"] = df["month"].map(month_trans)

In [41]:
df.head()

       date    month  year state  number_of_fires
0  1/1/1998  January  1998  Acre              0.0
1  1/1/1999  January  1999  Acre              0.0
2  1/1/2000  January  2000  Acre              0.0
3  1/1/2001  January  2001  Acre              0.0
4  1/1/2002  January  2002  Acre              0.0

In [42]:
df["month"].unique()

array(['January', 'Febuary', 'March', 'April', 'May', 'June', 'July',
       'August', 'September', 'October', 'November', 'December'],
      dtype=object)

In [44]:
df["state"].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [46]:
df["state"] = df["state"].str.title()
df["state"].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'Pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'Rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [47]:
df.drop(["date"], axis=1, inplace=True)

In [48]:
df.head()

     month  year state  number_of_fires
0  January  1998  Acre              0.0
1  January  1999  Acre              0.0
2  January  2000  Acre              0.0
3  January  2001  Acre              0.0
4  January  2002  Acre              0.0